In [1]:
import pandas as pd

In [10]:
two_dimensional_list = [['aaa', 100, 100], ['bbb', 90, 80], ['ccc', 50, 90], ['ddd', 50, 90]]

In [12]:
my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'eng', 'math'], index=['a', 'b', 'c', 'd'])
my_df

  name  eng  math
a  aaa  100   100
b  bbb   90    80
c  ccc   50    90
d  ddd   50    90

In [13]:
type(my_df)

pandas.core.frame.DataFrame

In [14]:
my_df.columns

Index(['name', 'eng', 'math'], dtype='object')

In [15]:
my_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
my_df.dtypes

name    object
eng      int64
math     int64
dtype: object

### DataFrame 생성 <- 2차원 array, numpy array, pandas Series

In [18]:
import numpy as np
import pandas as pd

In [19]:
two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]
two_dimensional_array = np.array(two_dimensional_list)
list_of_series = [
    pd.Series(['dongwook', 50, 86]), 
    pd.Series(['sineui', 89, 31]), 
    pd.Series(['ikjoong', 68, 91]), 
    pd.Series(['yoonsoo', 88, 75])
]

In [20]:
df1 = pd.DataFrame(two_dimensional_list)
df2 = pd.DataFrame(two_dimensional_array)
df3 = pd.DataFrame(list_of_series)

In [21]:
df1

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [22]:
df2

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

In [23]:
df3

          0   1   2
0  dongwook  50  86
1    sineui  89  31
2   ikjoong  68  91
3   yoonsoo  88  75

### DataFrame <- dictionary

In [24]:
names = ['dongwook', 'sineui', 'ikjoong', 'yoonsoo']
english_scores = [50, 89, 68, 88]
math_scores = [86, 31, 91, 75]

dict1 = {
    'name': names, 
    'english_score': english_scores, 
    'math_score': math_scores
}

dict2 = {
    'name': np.array(names), 
    'english_score': np.array(english_scores), 
    'math_score': np.array(math_scores)
}

dict3 = {
    'name': pd.Series(names), 
    'english_score': pd.Series(english_scores), 
    'math_score': pd.Series(math_scores)
}

In [28]:
df1 = pd.DataFrame(dict1)
df2 = pd.DataFrame(dict2)
df3 = pd.DataFrame(dict3)

In [29]:
df1

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [30]:
df2

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

In [31]:
df3

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

### DataFrame <- dictionary list

In [32]:
my_list = [
    {'name': 'dongwook', 'english_score': 50, 'math_score': 86},
    {'name': 'sineui', 'english_score': 89, 'math_score': 31},
    {'name': 'ikjoong', 'english_score': 68, 'math_score': 91},
    {'name': 'yoonsoo', 'english_score': 88, 'math_score': 75}
]

In [33]:
df = pd.DataFrame(my_list)

In [34]:
df

       name  english_score  math_score
0  dongwook             50          86
1    sineui             89          31
2   ikjoong             68          91
3   yoonsoo             88          75

### 실습과제

In [35]:
import pandas as pd

In [40]:
df = pd.DataFrame([['Taylor Swift', 'December 13, 1989', 'Singer-songwriter'],
             ['Aaron Sorkin', 'June 9, 1961', 'Screenwriter'],
             ['Harry Potter', 'July 31, 1980', 'Wizard'],
             ['Ji-Sung Park', 'February 25, 1981', 'Footballer']],
            columns=['name', 'birthday', 'occupation'])

In [45]:
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [47]:
df.dtypes

name          object
birthday      object
occupation    object
dtype: object

### dtypes 데이터타입 확인

In [42]:
two_dimensional_list = [['dongwook', 50, 86], ['sineui', 89, 31], ['ikjoong', 68, 91], ['yoonsoo', 88, 75]]

my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'english_score', 'math_score'], index=['a', 'b', 'c', 'd'])

In [43]:
my_df

       name  english_score  math_score
a  dongwook             50          86
b    sineui             89          31
c   ikjoong             68          91
d   yoonsoo             88          75

In [44]:
my_df.dtypes

name             object
english_score     int64
math_score        int64
dtype: object